[
    {
      "title": "Cyberpunk 2077 Next-Gen Update Released",
      "slug": "cyberpunk-2077-next-gen-update-released",
      "content": "CD Projekt Red has released the long-awaited next-gen update for Cyberpunk 2077, bringing improved graphics, performance, and gameplay features to PlayStation 5 and Xbox Series X|S consoles. The update also includes numerous bug fixes and quality-of-life improvements, delivering a much more polished experience than the game's initial launch. PC players will also benefit from the update with improved ray tracing features and a variety of new visual settings.",
      "excerpt": "CD Projekt Red releases major update for PlayStation 5 and Xbox Series X|S, improving graphics and performance.",
      "imageUrl": "cyberpunk-update.jpg",
      "author": "GameNews Staff",
      "publishDate": "2022-02-15",
      "tags": ["Cyberpunk 2077", "CD Projekt Red", "Update", "PlayStation 5", "Xbox Series X"],
      "featured": true
    },
    {
      "title": "Elden Ring Breaks Sales Records",
      "slug": "elden-ring-breaks-sales-records",
      "content": "FromSoftware's latest title, Elden Ring, has shattered sales records worldwide, becoming the fastest-selling Souls-like game ever made. The collaboration between game director Hidetaka Miyazaki and fantasy author George R.R. Martin has proven to be a massive success, with critics praising the game's expansive open world, challenging combat, and intricate lore. Bandai Namco has announced that the game sold over 12 million copies in its first three weeks, far exceeding their sales projections.",
      "excerpt": "FromSoftware's open-world RPG becomes fastest-selling Souls-like game of all time.",
      "imageUrl": "elden-ring-sales.jpg",
      "author": "Sarah Johnson",
      "publishDate": "2022-03-14",
      "tags": ["Elden Ring", "FromSoftware", "Sales", "RPG"],
      "featured": true
    },
    {
      "title": "PlayStation Announces New PS Plus Tiers",
      "slug": "playstation-announces-new-ps-plus-tiers",
      "content": "Sony has revealed a major overhaul of its PlayStation Plus subscription service, introducing three different tiers with varying benefits. The new structure combines PS Plus and PS Now into a single service, offering a library of games that will include up to 400 PS4 and PS5 titles in the higher tiers. The Premium tier will also include classic games from original PlayStation, PS2, and PSP consoles, as well as time-limited game trials. The new service is set to launch in June.",
      "excerpt": "Sony combines PS Plus and PS Now into a new three-tier subscription service launching in June.",
      "imageUrl": "ps-plus-tiers.jpg",
      "author": "Mark Wilson",
      "publishDate": "2022-03-29",
      "tags": ["PlayStation", "PS Plus", "Subscription", "Sony"],
      "featured": false
    },
    {
      "title": "Microsoft Acquires Activision Blizzard",
      "slug": "microsoft-acquires-activision-blizzard",
      "content": "In a landmark deal worth $68.7 billion, Microsoft has announced its acquisition of gaming giant Activision Blizzard. This massive purchase brings franchises like Call of Duty, World of Warcraft, and Candy Crush under the Xbox umbrella, significantly expanding Microsoft's gaming portfolio. The acquisition, which still needs to clear regulatory hurdles, would make Microsoft the third-largest gaming company by revenue, behind only Tencent and Sony. Microsoft has stated that they plan to add many of Activision Blizzard's games to Game Pass once the deal closes.",
      "excerpt": "Tech giant purchases Activision Blizzard for $68.7 billion in largest gaming acquisition ever.",
      "imageUrl": "microsoft-activision.jpg",
      "author": "David Chen",
      "publishDate": "2022-01-18",
      "tags": ["Microsoft", "Activision Blizzard", "Acquisition", "Xbox"],
      "featured": true
    },
    {
      "title": "Nintendo Announces New Zelda Title in Development",
      "slug": "nintendo-announces-new-zelda-title",
      "content": "During their latest Nintendo Direct presentation, Nintendo confirmed that a new Legend of Zelda title is currently in development. While details remain scarce, the company shared that this game will be set in the same world as Breath of the Wild, but will feature a completely new story and gameplay mechanics. A brief teaser trailer showed Link exploring what appeared to be underground caverns with new magical abilities. Nintendo stated that they are targeting a release window of next year, though no specific date was provided.",
      "excerpt": "New Legend of Zelda game set in the Breath of the Wild universe announced during Nintendo Direct.",
      "imageUrl": "new-zelda-teaser.jpg",
      "author": "Emma Rodriguez",
      "publishDate": "2022-04-01",
      "tags": ["Nintendo", "Legend of Zelda", "Nintendo Switch"],
      "featured": false
    }
  ]